RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_flash.c
  /* Reset error code */
  pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

  if (status == HAL_OK)
  {
    switch (TypeProgram)
    {
      case FLASH_TYPEPROGRAM_BYTE:
        /* Program a byte (8-bit) at a specified address */
        FLASH_Program_Byte(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_HALFWORD:
        /* Program a half-word (16-bit) at a specified address */
        FLASH_Program_HalfWord(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_WORD:
        /* Program a word (32-bit) at a specified address */
        FLASH_Program_Word(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_DOUBLEWORD:
        /* Program a double-word (64-bit) at a specified address */
        FLASH_Program_DoubleWord(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_QUADWORD:
        /* Program a quad-word (128-bit) at a specified address */
        FLASH_Program_QuadWord(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_OTP_HALFWORD:
        /* Program a half-word (16-bit) at a OTP address */
        FLASH_Program_OTPHalfWord(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_OTP_WORD:
        /* Program a word (32-bit) at a OTP address */
        FLASH_Program_OTPWord(Address, DataAddress);
        break;

      default:
        status = HAL_ERROR;
        break;
    }

    if (status != HAL_ERROR)
    {
      /* Wait for last operation to be completed */
      status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

      /* If the program operation is completed, disable the PG (and FW Bit in non quad-word mode) */
      CLEAR_BIT(FLASH->CR, (TypeProgram & ~(FLASH_WORD_SIZE_MASK)));
    }
  }

  /* Process Unlocked */
  __HAL_UNLOCK(&pFlash);

  /* return status */
  return status;
}

/**
  * @brief  Program a data at a specified address with interrupt enabled.
  * @param  TypeProgram  Indicate the way to program at a specified address.
  *                      This parameter can be a value of @ref FLASH_Type_Program
  * @param  Address  specifies the address to be programmed.
  * @param  DataAddress specifies the address of data to be programmed
  *
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASH_Program_IT(uint32_t TypeProgram, uint32_t Address, uint32_t DataAddress)
{
  HAL_StatusTypeDef status;

  /* Check the parameters */
  assert_param(IS_FLASH_TYPEPROGRAM(TypeProgram));

  /* Process Locked */
  __HAL_LOCK(&pFlash);

  /* Reset error code */
  pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

  if (status != HAL_OK)
  {
    /* Process Unlocked */
    __HAL_UNLOCK(&pFlash);
  }
  else
  {
    /* Set internal variables used by the IRQ handler */
    pFlash.ProcedureOnGoing = TypeProgram;
    pFlash.Address = Address;

    /* Enable End of Operation and Error interrupts */
    SET_BIT(FLASH->IER, (FLASH_IT_EOP | FLASH_IT_WRPERR | FLASH_IT_PGSERR | FLASH_IT_STRBERR | FLASH_IT_INCERR));

    switch (TypeProgram)
    {
      case FLASH_TYPEPROGRAM_BYTE:
        /* Program a byte (8-bit) at a specified address */
        FLASH_Program_Byte(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_HALFWORD:
        /* Program a half-word (16-bit) at a specified address */
        FLASH_Program_HalfWord(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_WORD:
        /* Program a word (32-bit) at a specified address */
        FLASH_Program_Word(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_DOUBLEWORD:
        /* Program a double-word (64-bit) at a specified address */
        FLASH_Program_DoubleWord(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_QUADWORD:
        /* Program a quad-word (128-bit) at a specified address */
        FLASH_Program_QuadWord(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_OTP_HALFWORD:
        /* Program a half-word (16-bit) at a OTP address */
        FLASH_Program_OTPHalfWord(Address, DataAddress);
        break;

      case FLASH_TYPEPROGRAM_OTP_WORD:
        /* Program a word (32-bit) at a OTP address */
        FLASH_Program_OTPWord(Address, DataAddress);
        break;

      default:
        status = HAL_ERROR;

        /* Process Unlocked */
        __HAL_UNLOCK(&pFlash);
        break;
    }
  }

  return status;
}

/**
  * @brief  Handle FLASH interrupt request.
  * @retval None
  */
void HAL_FLASH_IRQHandler(void)
{
  uint32_t param = 0U;
  uint32_t error;

  /* Save Flash errors */
  error = FLASH->ISR & FLASH_FLAG_ISR_ERRORS;
  error |= (FLASH->OPTISR & FLASH_FLAG_OPTISR_ERRORS);

  /* Set parameter of the callback */
  if (pFlash.ProcedureOnGoing == FLASH_TYPEERASE_SECTORS)
  {
    param = pFlash.Sector;
  }
  else if ((pFlash.ProcedureOnGoing & FLASH_CR_PG) != 0U)
  {
    param = pFlash.Address;
  }
  else
  {
    /* Empty statement (to be compliant MISRA 15.7) */
  }

  /* Clear operation bit on the on-going procedure */
  CLEAR_BIT(FLASH->CR, (pFlash.ProcedureOnGoing & ~(FLASH_WORD_SIZE_MASK)));

  /* Check FLASH operation error flags */
  if (error != 0U)
  {
    /* Save the error code */
    pFlash.ErrorCode |= error;

    /* Clear error programming flags */
    FLASH->ICR = (error & FLASH_FLAG_ISR_ERRORS);
    FLASH->OPTICR = (error & FLASH_FLAG_OPTISR_ERRORS);

    /* Stop the procedure ongoing */
    pFlash.ProcedureOnGoing = 0U;

    /* FLASH error interrupt user callback */
    HAL_FLASH_OperationErrorCallback(param);
  }

  /* Check FLASH End of Operation flag  */
  if ((FLASH->ISR & FLASH_FLAG_EOP) != 0U)
  {
    /* Clear FLASH End of Operation pending bit */
    FLASH->ICR = FLASH_FLAG_EOP;

    if (pFlash.ProcedureOnGoing == FLASH_TYPEERASE_SECTORS)
    {
      /* Nb of sectors to erase can be decreased */
      pFlash.NbSectorsToErase--;

