RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_flash.c
  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @brief  Program a half-word (16-bit) at a OTP address.
  * @param  Address specifies the address to be programmed.
  * @param  DataAddress specifies the address of data to be programmed.
  * @retval None
  */
static void FLASH_Program_OTPHalfWord(uint32_t Address, uint32_t DataAddress)
{
  uint16_t *dest_addr = (uint16_t *)Address;
  uint16_t *src_addr  = (uint16_t *)DataAddress;
  uint32_t primask_bit;

  /* Check the parameters */
  assert_param(IS_FLASH_OTP_ADDRESS(Address));

  /* Set PG_OTP bit */
  SET_BIT(FLASH->CR, FLASH_CR_PG_OTP);

  /* Enter critical section: Disable interrupts to avoid any interruption during the loop */
  primask_bit = __get_PRIMASK();
  __disable_irq();

  /* Program the half-word */
  *dest_addr = *src_addr;

  __ISB();
  __DSB();

  /* Set FW bit */
  SET_BIT(FLASH->CR, FLASH_CR_FW);

  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @brief  Program a word (32-bit) at a OTP address.
  * @param  Address specifies the address to be programmed.
  * @param  DataAddress specifies the address of data to be programmed.
  * @retval None
  */
static void FLASH_Program_OTPWord(uint32_t Address, uint32_t DataAddress)
{
  uint8_t index = 2;
  uint16_t *dest_addr = (uint16_t *)Address;
  uint16_t *src_addr  = (uint16_t *)DataAddress;
  uint32_t primask_bit;

  /* Check the parameters */
  assert_param(IS_FLASH_OTP_ADDRESS(Address));

  /* Set PG_OTP bit */
  SET_BIT(FLASH->CR, FLASH_CR_PG_OTP);

  /* Enter critical section: Disable interrupts to avoid any interruption during the loop */
  primask_bit = __get_PRIMASK();
  __disable_irq();

  /* Program the word */
  do
  {
    *dest_addr = *src_addr;
    dest_addr++;
    src_addr++;
    index--;
  } while (index != 0U);

  __ISB();
  __DSB();

  /* Set FW bit */
  SET_BIT(FLASH->CR, FLASH_CR_FW);

  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @}
  */

#endif /* HAL_FLASH_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
